chejia12/rt-thread/bsp/n32/n32gxx_lxx/n32g457qel-stb/user58/drv_tim_external_counter.c
/**
 * @file drv_tim_external_counter.c
 * @brief
 * @author jiache (wanghuan3037@fiberhome.com)
 * @version 1.0
 * @date 2025-11-28
 * 2025-11-28
 *  1.驱动的优化，并测试额所有的定时器均可实现外部时钟1方式计数
                name=eclktm1 ===》 TIM1 PA8
                name=eclktm2 ===》 TIM2 PA15
                name=eclktm3 ===》 TIM3 PA6
                name=eclktm4 ===》 TIM4 PB6
                name=eclktm5 ===》 TIM5 PA0
                name=eclktm8 ===》 TIM8 PC6
    2.RT_USING_DEVICE_OPS操作方式的实现
    3.日志标签的加入
*2025-12-1
    1.测试了每个定时器的通道1，通道的默认复用引脚，外部时钟1计数均OK
    2.外部计数的引脚复用全部采用Kconfig方式配置
 * 202512-2
 *      1.将定时器的时钟和gpio时钟统一放在drv_base.c中

2025-12-08
    1.移植兼容N32L40X的兼容代码，修改了Kconfig添加了配置
    2.测试了TIM1的PA8,测量1MHz的脉冲没有问题；测量10M也是OK的，示波器显示10.7MHz，实测10666668
2025-12-12
    1.添加了N32L406的TIM2,TIM3的外部计数配置添加
2026-03-27
	在L406平台发现tim2和tim3的中断号配置成tim1的中断号了
2026-04-24
	添加注释
	新增了L406平台的TIM4,TIM5,TIM8,的配置信息
 *-
 * @copyright Copyright (c) 2025  58
 *
 */
#include <rtthread.h>
#ifdef BSP_USING_TIM_EXT_COUNTER
#include "board.h"
#include <rtdevice.h>

#define DBG_TAG "TIM_CNT"
#ifdef BSP_USING_TIM_ETR_CNT_DEBUG
#define DBG_LVL DBG_LOG
#else
#define DBG_LVL DBG_INFO
#endif
#include <rtdbg.h>

/**这里为每一个定时器分配一个ID */
enum
{
#ifdef BSP_USING_TIM1_EXT_COUNTER
    EXT_CLK_TIM1,
#endif
#ifdef BSP_USING_TIM2_EXT_COUNTER
    EXT_CLK_TIM2,
#endif
#ifdef BSP_USING_TIM3_EXT_COUNTER
    EXT_CLK_TIM3,
#endif
#ifdef BSP_USING_TIM4_EXT_COUNTER
    EXT_CLK_TIM4,
#endif
#ifdef BSP_USING_TIM5_EXT_COUNTER
    EXT_CLK_TIM5,
#endif
#ifdef BSP_USING_TIM8_EXT_COUNTER
    EXT_CLK_TIM8,
#endif
    EXT_CLK_NUM/*这里就是设备的数量*/
};

/**
 * @brief 定时器处于外部时钟1计数模式下的先关配置
 * 
 */
struct n32_tim_ext_counter_config
{
    TIM_Module *timer_periph; /* 定时器外设 */
    GPIO_Module *gpio_periph; /* GPIO外设 */
    uint16_t gpio_pin;        /* GPIO引脚 */
    uint32_t gpio_af;         /* GPIO复用功能 */
    uint16_t tim_channel;     /* 定时器通道 */
    uint16_t polarity;        /* 极性配置 */
    uint16_t filter;          /* 滤波配置 */
    IRQn_Type irqn;           /* 中断号 */
    const char *info;         /* 设备信息 */
};

/* 外部计数器设备结构体 */
struct n32_tim_ext_counter_device
{
    struct rt_device parent;
    struct n32_tim_ext_counter_config *config;
    rt_uint32_t count_value;
    rt_uint32_t overflow_count;
    void (*overflow_callback)(rt_device_t dev); /* 修正回调函数签名 */
    void *callback_args;
};
/*注册函数声明*/
static rt_err_t n32_tim_ext_counter_register(struct n32_tim_ext_counter_device *device,
                                             const char *name,
                                             struct n32_tim_ext_counter_config *config);
											 

/**
 * @brief 使能对应GPIO的时钟
 */
void n32_gpio_rcc_enable(GPIO_Module *gpio_grp)
{
    assert_param(IS_GPIO_ALL_PERIPH(gpio_grp));
    if (GPIOA == gpio_grp)
    {
        RCC_EnableAPB2PeriphClk(RCC_APB2_PERIPH_GPIOA, ENABLE);
         LOG_D("enable gpio rcc GPIOA");
    }
    else if (GPIOB == gpio_grp)
    {
        RCC_EnableAPB2PeriphClk(RCC_APB2_PERIPH_GPIOB, ENABLE);
        LOG_D("enable gpio rcc GPIOB");
    }
    else if (GPIOC == gpio_grp)
    {
        RCC_EnableAPB2PeriphClk(RCC_APB2_PERIPH_GPIOC, ENABLE);
         LOG_D("enable gpio rcc GPIOC");
    }
    else if (GPIOD == gpio_grp)
    {
        RCC_EnableAPB2PeriphClk(RCC_APB2_PERIPH_GPIOD, ENABLE);
         LOG_D("enable gpio rcc GPIOD");
    }
#if defined(SOC_N32G45X) || defined(SOC_N32WB452) || defined(SOC_N32G4FR)
    else if (GPIOE == gpio_grp)
    {
        RCC_EnableAPB2PeriphClk(RCC_APB2_PERIPH_GPIOE, ENABLE);
		LOG_D("enable gpio rcc GPIOE");
    }
    else if (GPIOF == gpio_grp)
    {
        RCC_EnableAPB2PeriphClk(RCC_APB2_PERIPH_GPIOF, ENABLE);
		LOG_D("enable gpio rcc GPIOF");
    }
    else if (GPIOG == gpio_grp)
    {
        RCC_EnableAPB2PeriphClk(RCC_APB2_PERIPH_GPIOG, ENABLE);
		LOG_D("enable gpio rcc GPIOG");
    }
#endif
}
/**定时器2的引脚涉及了SWD-JTAG的调试引脚，在复用时需要先设置jSWD-JTAG的复用
            * 复用功能 		GPIO端口
               JTMS/SWDIO 		PA13-----------swd
               JTCK/SWCLK 		A14------------swd
               JTDI 			PA15
               JTDO 			PB3
               NJTRST 			PB4

            * GPIO_ConfigPinRemap(GPIO_RMP_SW_JTAG_SW_ENABLE,ENABLE);
*/
void gpio_remap_JTAGOFF_SWDON(GPIO_Module *gpio_grp, uint16_t pin)
{
#if defined(SOC_N32G45X) || defined(SOC_N32WB452) || defined(SOC_N32G4FR)

    if ((GPIOA == gpio_grp && pin==GPIO_PIN_15) ||
        (GPIOB == gpio_grp && pin==GPIO_PIN_3) ||
        (GPIOB == gpio_grp && pin==GPIO_PIN_4))
    {
        RCC_EnableAPB2PeriphClk(RCC_APB2_PERIPH_AFIO, ENABLE);
        GPIO_ConfigPinRemap(GPIO_RMP_SW_JTAG_SW_ENABLE, ENABLE);
    }
#endif
}

/**
 * @brief  定时器的时钟使能配置
 */
void n32_time_rcc_config(TIM_Module *htim)
{
    RT_ASSERT(TIM1 == htim || TIM2 == htim || TIM3 == htim || TIM4 == htim || TIM5 == htim || TIM8 == htim
#if defined(SOC_N32G45X) || defined(SOC_N32WB452) || defined(SOC_N32G4FR)
    );
#else
              || TIM9 == htim);
#endif

    if (TIM1 == htim)
    {
        RCC_EnableAPB2PeriphClk(RCC_APB2_PERIPH_TIM1, ENABLE);
    }
    else if (TIM2 == htim)
    {
        RCC_EnableAPB1PeriphClk(RCC_APB1_PERIPH_TIM2, ENABLE);
    }
    else if (TIM3 == htim)
    {
        RCC_EnableAPB1PeriphClk(RCC_APB1_PERIPH_TIM3, ENABLE);
    }
    else if (TIM4 == htim)
    {
        RCC_EnableAPB1PeriphClk(RCC_APB1_PERIPH_TIM4, ENABLE);
    }
    else if (TIM5 == htim)
    {
        RCC_EnableAPB1PeriphClk(RCC_APB1_PERIPH_TIM5, ENABLE);
    }
    else if (TIM8 == htim)
    {
        RCC_EnableAPB2PeriphClk(RCC_APB2_PERIPH_TIM8, ENABLE);
    }
#if defined(SOC_N32L43X) || defined(SOC_N32L40X) || defined(SOC_N32G43X)
    else if (TIM9 == htim)
    {
        RCC_EnableAPB1PeriphClk(RCC_APB1_PERIPH_TIM9, ENABLE);
    }
#endif
}
											 
/*外部计数器初始化 */
static struct n32_tim_ext_counter_config tim1_ext_counter_config[EXT_CLK_NUM] =
    {
#if defined(SOC_N32G45X) || defined(SOC_N32WB452) || defined(SOC_N32G4FR)
#define N32_EXT_CLK_CNT_G457 
#ifdef BSP_USING_TIM1_EXT_COUNTER /*CH1=PA8(0,1,2),PE9(3) ; CH2=PA9(0,1,2),PE11(3)*/
        {
            .timer_periph = TIM1,
            .polarity = TIM_IC_POLARITY_RISING,
            .filter = 0x0,
            .irqn = TIM1_UP_IRQn,

