chejia12/rt-thread/bsp/n32/n32gxx_lxx/n32g457qel-stb/user58/drv_tim_external_counter.c
#ifdef TIM8_CH2_PC7
            .tim_channel = TIM_CH_2,
            .gpio_periph = GPIOC,
            .gpio_pin = GPIO_PIN_7,
            .gpio_af = 0,
            .info = "TIM8 PC7",
#endif /*TIM8_CH2_PC7*/

#ifdef TIM8_CH2_PD15
            .tim_channel = TIM_CH_2,
            .gpio_periph = GPIOD,
            .gpio_pin = GPIO_PIN_15,
            .gpio_af = GPIO_RMP3_TIM8,
            .info = "TIM8 PD15",
#endif /*TIM8_CH2_PD15*/
        },
#endif /*BSP_USING_TIM8_EXT_COUNTER*/
#elif defined(SOC_N32L43X) || defined(SOC_N32L40X) || defined(SOC_N32G43X)

/*********************************N32_EXT_CLK_CNT_L406********************************** */
#define N32_EXT_CLK_CNT_L406
#ifdef BSP_USING_TIM1_EXT_COUNTER
        {

            .timer_periph = TIM1,
            .polarity = TIM_IC_POLARITY_RISING,
            .filter = 0x0,
            .irqn = TIM1_UP_IRQn,
#ifdef TIM1_CH1_PA8
            .tim_channel = TIM_CH_1,
            .gpio_periph = GPIOA,
            .gpio_pin = GPIO_PIN_8,
            .gpio_af = GPIO_AF2_TIM1,
            .info = "TIM1 PA8",
#endif /*TIM1_CH1_PA8*/
        },
#endif /*BSP_USING_TIM1_EXT_COUNTER*/

#ifdef BSP_USING_TIM2_EXT_COUNTER
        {

            .timer_periph = TIM2,
            .polarity = TIM_IC_POLARITY_RISING,
            .filter = 0x0,
            .irqn = TIM2_IRQn,
#ifdef TIM2_CH1_PA0
            .tim_channel = TIM_CH_1,
            .gpio_periph = GPIOA,
            .gpio_pin = GPIO_PIN_0,
            .gpio_af = GPIO_AF2_TIM2,
            .info = "TIM2 PA0",
#endif /*TIM2_CH1_PA0*/
#ifdef TIM2_CH1_PA15
            .tim_channel = TIM_CH_1,
            .gpio_periph = GPIOA,
            .gpio_pin = GPIO_PIN_15,
            .gpio_af = GPIO_AF5_TIM2,
            .info = "TIM2 PA15",
#endif /*TIM2_CH1_PA15*/
#ifdef TIM2_CH2_PA1
            .tim_channel = TIM_CH_2,
            .gpio_periph = GPIOA,
            .gpio_pin = GPIO_PIN_1,
            .gpio_af = GPIO_AF2_TIM2,
            .info = "TIM2 PA1",
#endif /*TIM2_CH2_PA1*/
#ifdef TIM2_CH2_PB3
            .tim_channel = TIM_CH_2,
            .gpio_periph = GPIOB,
            .gpio_pin = GPIO_PIN_3,
            .gpio_af = GPIO_AF2_TIM2,
            .info = "TIM2 PB3",
#endif /*TIM2_CH2_PB3*/
        },
#endif /*BSP_USING_TIM2_EXT_COUNTER*/


#ifdef BSP_USING_TIM3_EXT_COUNTER
        {

            .timer_periph = TIM3,
            .polarity = TIM_IC_POLARITY_RISING,
            .filter = 0x0,
            .irqn = TIM3_IRQn,
#ifdef TIM3_CH1_PA6
            .tim_channel = TIM_CH_1,
            .gpio_periph = GPIOA,
            .gpio_pin = GPIO_PIN_6,
            .gpio_af = GPIO_AF2_TIM3,
            .info = "TIM3 PA6",
#endif /*TIM3_CH1_PA6*/
#ifdef TIM3_CH1_PB4
            .tim_channel = TIM_CH_1,
            .gpio_periph = GPIOB,
            .gpio_pin = GPIO_PIN_4,
            .gpio_af = GPIO_AF5_TIM3,
            .info = "TIM3 PB4",
#endif /*TIM3_CH1_PB4*/
#ifdef TIM3_CH1_PC6
            .tim_channel = TIM_CH_1,
            .gpio_periph = GPIOC,
            .gpio_pin = GPIO_PIN_6,
            .gpio_af = GPIO_AF5_TIM3,
            .info = "TIM3 PC6",
#endif /*TIM3_CH1_PC6*/
#ifdef TIM3_CH2_PA7
            .tim_channel = TIM_CH_2,
            .gpio_periph = GPIOA,
            .gpio_pin = GPIO_PIN_7,
            .gpio_af = GPIO_AF2_TIM3,
            .info = "TIM3 PA7",
#endif /*TIM3_CH2_PA7*/
#ifdef TIM3_CH2_PB5
            .tim_channel = TIM_CH_2,
            .gpio_periph = GPIOB,
            .gpio_pin = GPIO_PIN_5,
            .gpio_af = GPIO_AF2_TIM3,
            .info = "TIM3 PB5",
#endif /*TIM3_CH2_PB5*/
#ifdef TIM3_CH2_PC7
            .tim_channel = TIM_CH_2,
            .gpio_periph = GPIOC,
            .gpio_pin = GPIO_PIN_7,
            .gpio_af = GPIO_AF2_TIM3,
            .info = "TIM3 PC7",
#endif /*TIM3_CH2_PC7*/
        },
#endif /*BSP_USING_TIM3_EXT_COUNTER*/


/***************N32L406 TIM4 ****************************/
#ifdef BSP_USING_TIM4_EXT_COUNTER
        {

            .timer_periph = TIM4,
            .polarity = TIM_IC_POLARITY_RISING,
            .filter = 0x0,
            .irqn = TIM4_IRQn,
#ifdef TIM4_EXCK1_CH1_PB6
            .tim_channel = TIM_CH_1,
            .gpio_periph = GPIOB,
            .gpio_pin = GPIO_PIN_6,
            .gpio_af = GPIO_AF2_TIM4,
            .info = "TIM4 PB6",
#endif /*TIM4_EXCK1_CH1_PB6*/
#ifdef TIM4_EXCK1_CH2_PB7
            .tim_channel = TIM_CH_2,
            .gpio_periph = GPIOB,
            .gpio_pin = GPIO_PIN_7,
            .gpio_af = GPIO_AF2_TIM4,
            .info = "TIM4 PB7",
#endif /*TIM4_EXCK1_CH2_PB4*/
        },
#endif /*BSP_USING_TIM4_EXT_COUNTER*/

/***************N32L406 TIM5 ****************************/
#ifdef BSP_USING_TIM5_EXT_COUNTER
        {

            .timer_periph = TIM5,
            .polarity = TIM_IC_POLARITY_RISING,
            .filter = 0x0,
            .irqn = TIM5_IRQn,
#ifdef TIM5_EXCK1_CH1_PA0
            .tim_channel = TIM_CH_1,
            .gpio_periph = GPIOA,
            .gpio_pin = GPIO_PIN_0,
            .gpio_af = GPIO_AF1_TIM5,
            .info = "TIM5 PA0",
#endif /*TIM5_EXCK1_CH1_PB6*/
#ifdef TIM5_EXCK1_CH2_PA1
            .tim_channel = TIM_CH_2,
            .gpio_periph = GPIOA,
            .gpio_pin = GPIO_PIN_1,
            .gpio_af = GPIO_AF7_TIM5,
            .info = "TIM5 PA1",
#endif /*TIM5_EXCK1_CH2_PA1*/
        },
#endif /*BSP_USING_TIM5_EXT_COUNTER*/

/***************N32L406 TIM8 ****************************/
#ifdef BSP_USING_TIM8_EXT_COUNTER
        {

            .timer_periph = TIM8,
            .polarity = TIM_IC_POLARITY_RISING,
            .filter = 0x0,
            .irqn = TIM8_UP_IRQn,
#ifdef TIM8_EXCK1_CH1_PC6
            .tim_channel = TIM_CH_1,
            .gpio_periph = GPIOC,
            .gpio_pin = GPIO_PIN_6,
            .gpio_af = GPIO_AF6_TIM8,
            .info = "TIM8 PC6",
#endif /*TIM8_EXCK1_CH1_PC6*/
#ifdef TIM8_EXCK1_CH2_PC7
            .tim_channel = TIM_CH_2,
            .gpio_periph = GPIOC,
            .gpio_pin = GPIO_PIN_6,
            .gpio_af = GPIO_AF6_TIM8,
            .info = "TIM8 PC7",
#endif /*TIM8_EXCK1_CH2_PC7*/
        },
#endif /*BSP_USING_TIM8_EXT_COUNTER*/


/***************N32L406 TIM9 ****************************/
#ifdef BSP_USING_TIM9_EXT_COUNTER
        {

            .timer_periph = TIM9,
            .polarity = TIM_IC_POLARITY_RISING,
            .filter = 0x0,
            .irqn = TIM9_UP_IRQn,
#ifdef TIM9_EXCK1_CH1_PB12
            .tim_channel = TIM_CH_1,
            .gpio_periph = GPIOB,
            .gpio_pin = GPIO_PIN_12,
            .gpio_af = GPIO_AF1_TIM9,
            .info = "TIM9 PB12",
#endif /*TIM9_EXCK1_CH1_PB12*/
#ifdef TIM9_EXCK1_CH2_PB13
            .tim_channel = TIM_CH_2,
            .gpio_periph = GPIOB,
            .gpio_pin = GPIO_PIN_13,
            .gpio_af = GPIO_AF1_TIM9,
            .info = "TIM9 PB13",
#endif /*TIM9_EXCK1_CH2_PB13*/
        },
#endif /*BSP_USING_TIM9_EXT_COUNTER*/

#endif

