chejia12/rt-thread/bsp/n32/n32gxx_lxx/n32g457qel-stb/user58/drv_tim_external_counter.c
};

static struct n32_tim_ext_counter_device tim1_ext_counter_device[EXT_CLK_NUM];
/**
 * @brief 外部脉冲计数设备注册
 * 
 * @return int 
 */
static int rt_hw_tim1_ext_counter_init(void)
{

    char name[32];
    for (int i = 0; i < EXT_CLK_NUM; i++)
    {
        rt_memset(name, 0, 32);
        rt_snprintf(name, 32, "eclktm%d", i);
        n32_tim_ext_counter_register(tim1_ext_counter_device + i,
                                     name,
                                     tim1_ext_counter_config + i);
    }

    return RT_EOK;
}
INIT_DEVICE_EXPORT(rt_hw_tim1_ext_counter_init);

static rt_err_t n32_tim_ext_counter_init_hw(struct n32_tim_ext_counter_device *device)
{
    struct n32_tim_ext_counter_config *config = device->config;
    GPIO_InitType GPIO_InitStructure;
    TIM_TimeBaseInitType TIM_TimeBaseStructure;

    /* 使能时钟 */
    n32_gpio_rcc_enable(config->gpio_periph);
    n32_time_rcc_config(config->timer_periph);
#if defined(SOC_N32G45X) || defined(SOC_N32WB452) || defined(SOC_N32G4FR)

    /* 配置GPIO为输入模式 */
    GPIO_InitStructure.Pin = config->gpio_pin;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPD; /* 浮空输入 */
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitPeripheral(config->gpio_periph, &GPIO_InitStructure);

    /* 配置GPIO复用功能 */
    if (config->gpio_af)
        GPIO_ConfigPinRemap(config->gpio_af, ENABLE);
    if (GPIOA == config->gpio_periph && GPIO_PIN_15 == config->gpio_pin)
    {
        GPIO_ConfigPinRemap(GPIO_RMP_SW_JTAG_SW_ENABLE, ENABLE); /*!< JTAG-DP Disabled and SW-DP Enabled */
        LOG_I("use pa15");
    }
#elif defined(SOC_N32L43X) || defined(SOC_N32L40X) || defined(SOC_N32G43X)
    RCC_EnableAPB2PeriphClk(RCC_APB2_PERIPH_AFIO, ENABLE);
    GPIO_InitStruct(&GPIO_InitStructure);
    GPIO_InitStructure.Pin = config->gpio_pin;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Input;
    GPIO_InitStructure.GPIO_Current = GPIO_DC_4mA;
    GPIO_InitStructure.GPIO_Alternate = config->gpio_af;
    GPIO_InitStructure.GPIO_Slew_Rate = GPIO_Slew_Rate_High;
    GPIO_InitPeripheral(config->gpio_periph, &GPIO_InitStructure);
#endif
    /* 复位定时器 */
    TIM_DeInit(config->timer_periph);

    /* 配置定时器基本参数 */
    TIM_InitTimBaseStruct(&TIM_TimeBaseStructure);
    TIM_TimeBaseStructure.Period = 0xFFFF; /* 最大计数值 */
    TIM_TimeBaseStructure.Prescaler = 0;   /* 不分频 */
    TIM_TimeBaseStructure.ClkDiv = TIM_CLK_DIV1;
    TIM_TimeBaseStructure.CntMode = TIM_CNT_MODE_UP;
    TIM_InitTimeBase(config->timer_periph, &TIM_TimeBaseStructure);

    /* 配置外部时钟模式1 - 按照手册步骤 */
    uint16_t ext_clk_src;
    if (config->tim_channel == TIM_CH_1)
    {
        ext_clk_src = TIM_EXT_CLK_SRC_TI1;
        LOG_D("Configuring TI1 as external clock source");
    }
    else if (config->tim_channel == TIM_CH_2)
    {
        ext_clk_src = TIM_EXT_CLK_SRC_TI2;
        LOG_D("Configuring TI2 as external clock source");
    }
    else
    {
        LOG_E("Unsupported channel for external clock");
        return RT_ERROR;
    }

    /* 使用库函数配置外部时钟 */
    TIM_ConfigExtTrigAsClk(config->timer_periph, ext_clk_src, config->polarity, config->filter);

    /* 验证配置 - 读取寄存器确认设置 */
    LOG_D("SMCTRL register: 0x%08X", config->timer_periph->SMCTRL);
    LOG_D("CCMOD1 register: 0x%08X", config->timer_periph->CCMOD1);
    LOG_D("CCEN register: 0x%08X", config->timer_periph->CCEN);

    /* 配置更新中断（溢出中断） */
    TIM_ConfigInt(config->timer_periph, TIM_INT_UPDATE, ENABLE);
    TIM_ClearFlag(config->timer_periph, TIM_FLAG_UPDATE); // 中断标志清零

    /* 清零计数器 */
    TIM_SetCnt(config->timer_periph, 0);

    /* 使能定时器 */
    TIM_Enable(config->timer_periph, ENABLE);

    LOG_I("External counter initialized: %s", config->info);
    return RT_EOK;
}

static rt_err_t n32_tim_ext_counter_open(rt_device_t dev, rt_uint16_t oflag)
{
    struct n32_tim_ext_counter_device *device = (struct n32_tim_ext_counter_device *)dev;

    /* 初始化硬件 */
    n32_tim_ext_counter_init_hw(device);

    /* 使能中断 */
    NVIC_SetPriority(device->config->irqn, 3);
    NVIC_EnableIRQ(device->config->irqn);

    LOG_D("External counter %s opened", device->config->name);
    return RT_EOK;
}

static rt_err_t n32_tim_ext_counter_close(rt_device_t dev)
{
    struct n32_tim_ext_counter_device *device = (struct n32_tim_ext_counter_device *)dev;

    /* 禁用定时器 */
    TIM_Enable(device->config->timer_periph, DISABLE);

    /* 禁用中断 */
    NVIC_DisableIRQ(device->config->irqn);

    LOG_D("External counter %s closed", device->config->name);
    return RT_EOK;
}
static    rt_ssize_t n32_tim_ext_counter_read  (rt_device_t dev, rt_off_t pos, void *buffer, rt_size_t size)
{
    struct n32_tim_ext_counter_device *device = (struct n32_tim_ext_counter_device *)dev;
    rt_uint32_t *count_buf = (rt_uint32_t *)buffer;

    if (size < sizeof(rt_uint32_t))
        return 0;

    /* 读取当前计数值 */
    rt_uint32_t current_count = TIM_GetCnt(device->config->timer_periph);
    device->count_value = (device->overflow_count << 16) + current_count;

    // 清零计数器
    TIM_SetCnt(device->config->timer_periph, 0);
    device->overflow_count = 0;

    *count_buf = device->count_value;
    return sizeof(rt_uint32_t);
}

static rt_err_t n32_tim_ext_counter_control(rt_device_t dev, int cmd, void *args)
{
    struct n32_tim_ext_counter_device *device = (struct n32_tim_ext_counter_device *)dev;

    switch (cmd)
    {
    case RT_DEVICE_CTRL_RESUME:
        /* 复位计数器 */
        TIM_SetCnt(device->config->timer_periph, 0);
        device->overflow_count = 0;
        device->count_value = 0;
        break;

    case RT_DEVICE_CTRL_SET_INT:
        /* 设置溢出回调函数 */
        if (args)
        {
            struct rt_device_notify *notify = (struct rt_device_notify *)args;
            device->overflow_callback = notify->notify;
            device->callback_args = notify->dev; /* 使用dev字段传递参数 */
        }
        break;

    default:
        return RT_EINVAL;
    }

    return RT_EOK;
}

/* 中断处理函数模板 */
void n32_tim_ext_counter_irq_handler(struct n32_tim_ext_counter_device *device)
{
    rt_interrupt_enter(); // 进入中断
    if (TIM_GetIntStatus(device->config->timer_periph, TIM_INT_UPDATE) != RESET)
    {
        /* 清除中断标志 */
        TIM_ClrIntPendingBit(device->config->timer_periph, TIM_INT_UPDATE);

        /* 溢出计数 */
        device->overflow_count++;

