chejia12/rt-thread/bsp/n32/n32gxx_lxx/n32g457qel-stb/user58/drv_tim_external_counter.c
        /* 调用回调函数 */
        if (device->overflow_callback)
        {
            device->overflow_callback((rt_device_t)device->callback_args);
        }
    }
    rt_interrupt_leave(); // 离开中断
}
#ifdef RT_USING_DEVICE_OPS
/**设备操作函数接口 */
static const struct rt_device_ops ops = {
    .init = RT_NULL,
    .open = n32_tim_ext_counter_open,
    .close = n32_tim_ext_counter_close,
    .write = RT_NULL,
    .control = n32_tim_ext_counter_control,
    .read = n32_tim_ext_counter_read,

};
#endif

/**
 * @brief 外部计数设备注册
 * 
 * @param  device           注册设备指针
 * @param  name             注册设备名称
 * @param  config           注册相关配置
 * @return rt_err_t 
 */
static rt_err_t n32_tim_ext_counter_register(struct n32_tim_ext_counter_device *device,
                                             const char *name,
                                             struct n32_tim_ext_counter_config *config)
{
    RT_ASSERT(device != RT_NULL);
    RT_ASSERT(config != RT_NULL);

    device->config = config;
    device->count_value = 0;
    device->overflow_count = 0;
    device->overflow_callback = RT_NULL;
    device->callback_args = RT_NULL;
    device->parent.type = RT_Device_Class_Miscellaneous;
    device->parent.user_data = config;
#ifdef RT_USING_DEVICE_OPS
    device->parent.ops = &ops;
#else

    device->parent.init = RT_NULL;
    device->parent.open = n32_tim_ext_counter_open;
    device->parent.close = n32_tim_ext_counter_close;
    device->parent.read = n32_tim_ext_counter_read;
    device->parent.write = RT_NULL;
    device->parent.control = n32_tim_ext_counter_control;

#endif
    LOG_I("device name = %s infomations %s", name, config->info);
    return rt_device_register(&device->parent, name, RT_DEVICE_FLAG_RDONLY);
}

/* TIM1外部计数器中断处理 */
#ifdef BSP_USING_TIM1_EXT_COUNTER
void TIM1_UP_IRQHandler(void)
{
    rt_interrupt_enter();
    n32_tim_ext_counter_irq_handler(tim1_ext_counter_device + EXT_CLK_TIM1);
    rt_interrupt_leave();
}
#endif

/* TIM2外部计数器中断处理 */
#ifdef BSP_USING_TIM2_EXT_COUNTER
void TIM2_IRQHandler(void)
{
    rt_interrupt_enter();
    n32_tim_ext_counter_irq_handler(tim1_ext_counter_device + EXT_CLK_TIM2);
    rt_interrupt_leave();
}
#endif

/* TIM3外部计数器中断处理 */
#ifdef BSP_USING_TIM3_EXT_COUNTER
void TIM3_IRQHandler(void)
{
    rt_interrupt_enter();
    n32_tim_ext_counter_irq_handler(tim1_ext_counter_device + EXT_CLK_TIM3);
    rt_interrupt_leave();
}
#endif

/* TIM4外部计数器中断处理 */
#ifdef BSP_USING_TIM4_EXT_COUNTER
void TIM4_IRQHandler(void)
{
    rt_interrupt_enter();
    n32_tim_ext_counter_irq_handler(tim1_ext_counter_device + EXT_CLK_TIM4);
    rt_interrupt_leave();
}
#endif

/* TIM5外部计数器中断处理 */
#ifdef BSP_USING_TIM5_EXT_COUNTER
void TIM5_IRQHandler(void)
{
    rt_interrupt_enter();
    n32_tim_ext_counter_irq_handler(tim1_ext_counter_device + EXT_CLK_TIM5);
    rt_interrupt_leave();
}
#endif

/* TIM8外部计数器中断处理 */
#ifdef BSP_USING_TIM8_EXT_COUNTER
void TIM8_UP_IRQHandler(void)
{
    rt_interrupt_enter();
    n32_tim_ext_counter_irq_handler(tim1_ext_counter_device + EXT_CLK_TIM8);
    rt_interrupt_leave();
}
#endif /**/

/*************************************shell 中断指令用于测试*************************************************************** */
#ifdef RT_USING_FINSH
#include <stdlib.h>
#include <string.h>
#include <finsh.h>

enum pwm_list_parameters
{
    ETR_LIST_PROBE = 1,
    ETR_LIST_GET,
};

CMD_OPTIONS_STATEMENT(eclk_cnt_list)

static int eclk_cnt_list(int argc, char **argv)
{
    rt_err_t result = -RT_ERROR;
    char *result_str;
    static rt_device_t device = RT_NULL;
    uint32_t count = 0;
    if (argc > 1)
    {
        if (MSH_OPT_ID_GET(eclk_cnt_list) == ETR_LIST_PROBE)
        {
            if (argc == 3)
            {
                device = rt_device_find(argv[2]);
                if (device)
                {
                    rt_device_open(device, 0);
                }
                result_str = (device == RT_NULL) ? "failure" : "success";
                rt_kprintf("probe %s %s\n", argv[2], result_str);
                return (device == RT_NULL) ? -RT_ERROR : RT_EOK;
            }
            else
            {
                rt_kprintf("eclk_cnt  probe <device name>                  - probe eclk_cnt  by name\n");
                return -RT_EINVAL;
            }
        }
        else if (device == RT_NULL)
        {
            rt_kprintf("Please using 'eclk_cnt  probe <device name>' first.\n");
            return -RT_ERROR;
        }

        switch (MSH_OPT_ID_GET(eclk_cnt_list))
        {

        case ETR_LIST_GET:
            // arg2 = atoi(argv[2]);
            rt_device_read(device, 0, &count, sizeof(count));
            // count = bsp_timer_count_etr_get_count(device);
            rt_kprintf("Info of device count=  [%d]:\n", count);
            return RT_EOK;
            break;

        default:
            goto _usage;
        }
    }
    else
    {
        goto _usage;
    }
    return result;

_usage:
    rt_kprintf("Usage: \n");
    rt_kprintf("eclk_cnt  probe      <device name>                - probe eclk_cnt  by name\n");
    rt_kprintf("eclk_cnt  get                           - get eclk_cnt  cnt info\n");

    result = -RT_ERROR;
    return result;
}
CMD_OPTIONS_NODE_START(eclk_cnt_list)
CMD_OPTIONS_NODE(ETR_LIST_PROBE, probe, probe eclk_cnt name)
CMD_OPTIONS_NODE(ETR_LIST_GET, get, get eclk_cnt count)
CMD_OPTIONS_NODE_END
MSH_CMD_EXPORT_ALIAS(eclk_cnt_list, eclk_cnt, control eclk_cnt device, optenable);

#endif /* RT_USING_FINSH */
/*************************************shell 中断指令用于测试*************************************************************** */

#endif /*BSP_USING_TIM_EXT_COUNTER*/
/*************************************************************************************************** */

